{
 "heroes": [
   {
     "name": "Abaddon",
     "type": "Universal",
     "type_image": "img/hero_universal.png",
     "type_attack": "img/melee.svg",
     "complexity": 1,
     "complexity_image":"img/difficulty_1.png",
     "image": "img/abaddon.png",
     "image_big": "img/abaddon_big.png",
     "lore": {
        "full": "Фонтан Авернуса — джерело родової могутності, розлом первісної земної тверді, з якого вже протягом багатьох поколінь струменять випари віщунської сили. Кожного новонародженого з печерного Дому Авернус купають у чорному тумані, і через цей ритуал він отримує нерозривний зв'язок із містичними енергіями землі. Діти зростають, вважаючи себе непохитними захисниками родових традицій і звичаїв свого королівства… Одначе насправді вони захищають лише сам Фонтан. А мотиви первісного туману неясні.\n\nКоли немовля Абаддона купали у Фонтані, то щось пішло не так. У дитячих очах спалахнуло світло розуму, що злякало всіх присутніх і змусило перешіптуватися жерців. Його ростили з надією на те, що він, як і всі нащадки роду Авернус, обере шлях бойових тренувань, щоб у разі необхідності очолити родову армію для захисту земель пращурів. Та Абаддон був далеким від цього. Коли інші навчалися поводженню зі зброєю, він медитував біля туману. Абаддон глибоко вдихав випари, що підіймалися з Фонтану, і навчився об'єднувати свій дух із тим могуттям, що протікало глибоко під землею. Він перетворився на істоту з чорного туману.\n\nЦе було розчарування для роду Авернус. І старійшини, і молодь звинувачували його в нехтуванні власними обов'язками. Проте всі ці звинувачення припинилися, коли він вперше виїхав на битву і вони побачили як сила туману дала Абаддону владу над життям і смертю, владу, про яку ніхто з лордів роду Авернус не міг навіть мріяти.",
       "short": "Завдяки здатності лікуватися від ворожих атак Абаддон витримує майже будь-який напад. Він чаклує щит на союзників та запускає двосторонню туманну спіраль у друзів чи ворогів, завжди готовий ускочити в саме серце битви."
     },
     "abilities": [
       {
         "name": "Mist Coil",
         "description": "Абаддон запускає спіраль із вбивчого туману, що коштом здоров'я Абаддона завдає шкоди ворогам або зцілює союзників.",
         "image_ability": "img/abaddon_death_coil.png",
         "video": "img/Anime Dance Mix - Hypnodancer.mp4"

        },
       {
        "name": "Aphotic Shield",
        "description": "Оточує союзну істоту бар'єром із потоків темної енергії від усіх видів шкоди, що застосовує розвіювання та поглинає певну частину шкоди перед тим, як зникнути. Коли бар'єр знищують, він вибухає, завдаючи навколишнім ворогам стільки шкоди, скільки може поглинути.",
        "image_ability": "img/abaddon_aphotic_shield.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Curse of Avernus",
        "description": "Абаддон б'є ворога, накладаючи холодильний проклін, який сповільнює й завдає періодичної шкоди, а всі атаки по жертві пришвидшуються. Періодичну шкоду по спорудах зменшено на 100%.",
        "image_ability": "img/abaddon_frostmourne.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Borrowed Time",
        "description": "Поки діє здібність, отримувана шкода не зменшує здоров'я, а відновлює його. Також застосовує розвіювання. Якщо здібність не на зарядці, то вона автоматично активується, щойно здоров'я впаде нижче 400.",
        "image_ability": "img/abaddon_borrowed_time.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      }
     ],
     "talent_tree_image": "img/talents.svg",
     "talent_tree_image_2": "img/abaddon_tree.png",
     "passive": {
       "name": "Withering Mist",
       "description": "Ушкоджені вороги отримують негативний ефект Згубної імли на 5 с. У ворогів під її дією зменшується відновлення здоров'я на 35%, якщо вони мають менше 40% здоров'я.",
       "image_passive": "img/innate_icon.png"
      },
    "facets": [
      {
      "name": "The Quickening",
      "image": "img/abaddon_the_quickening.png"
    },
    {
      "name": "Malignant Mist",
      "image": "img/abaddon_the_mist_coil.png" 
    }
    ]
   },
   {
     "name": "Ancient Apparition",
     "type": "Intelligence",
     "type_image": "img/hero_intelligence.png",
     "type_attack": "img/ranged.svg",
     "complexity": 2,
     "complexity_image":"img/difficulty_2.png",
     "image": "img/ancient_apparition.png",
     "image_big": "img/ancient_apparition_big.png",
     "lore": {
        "full": "Кальдр, Древній Привид, — це проекція з-за меж часів. Він виник із холодної безкінечної порожнечі, котра передувала всесвіту й чекає на його кінець. Кальдр був, Кальдр є, Кальдр буде… І той, кого ми бачимо в нашому світі, хоч і здається нам сильним, але насправді є лише слабким згасним відлунням справжнього вічного Кальдра. Дехто вірить, що коли космос буде відживати свої останні роки, Древній Привид ставатиме молодшим, яскравішим та сильнішим, тоді як вічність буде гаснути. І тоді його влада над льодом зупинить усі матерії, а образ стане випромінювати неможливе для споглядання світло. Тоді він уже не буде Привидом!",
       "short": "Кальдр здатен випускати в будь-яку точку поля бою потужні крижані бомби, які до смерті заморожують ослаблих ворогів. Уповільнюючи ворога і посилюючи союзників, Кальдр становить постійну загрозу для тих, хто йому протистоїть."
     },
     "abilities": [
       {
         "name": "Cold Feet",
         "description": "Накладає на ворожу істоту заряди Убивчої паморозі, що розвіюються, якщо ціль залишить зону застосування. В іншому випадку за 4 секунди ціль буде приголомшено та заморожено на місці.",
         "image_ability": "img/ancient_apparition_cold_feet.png",
         "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Ice Vortex",
        "description": "Утворює вир крижаної енергії, що накладає заряди Убивчої паморозі й посилює магічну шкоду в області дії.",
        "image_ability": "img/ancient_apparition_ice_vortex.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Chilling Touch",
        "description": "Атаки Древнього Привида мають більшу дальність і завдають значної магічної шкоди. Накладає заряд Убивчої паморозі, що триває 3 с. Додатково накладає 100% сповільнення на 0,7 с.",
        "image_ability": "img/ancient_apparition_chilling_touch.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Ice Blast",
        "description": "Вибухова куля з граду, яка може вразити ціль у будь-якій точці мапи. При першому застосуванні Кальдр випускає у зазначеному напрямку трасуючий снаряд. Другим застосуванням зазначається місце детонації, після чого запускається власне сама куля — чим більше дистанція до цілі, тим більшим буде радіус дії. Вибух застосовує на всіх зачеплених ворожих істот Обмороження, що накладає заряд Убивчої паморозі й перешкоджає регенерації здоров'я чи зціленню. Якщо запас здоров'я жертв обмороження впаде нижче певної позначки, вони миттєво розсипляться.",
        "image_ability": "img/ancient_apparition_ice_blast.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      }
     ],
     "talent_tree_image": "img/talents.svg",
     "talent_tree_image_2": "img/app_tree.png",
     "passive": {
       "name": "Death Rime",
       "description": "Здібності Древнього Привида застосовують на ворогів заряди Убивчої паморозі, які зменшують швидкість руху й завдають періодичної шкоди.",
       "image_passive": "img/innate_icon.png"
      },
    "facets": [
      {
      "name": "Bone Chill",
      "image": "img/anc.png"
    },
    {
      "name": "Exposure",
      "image": "img/ancient_app.png" 
    }
    ]
   },
   {
     "name": "Bristleback",
     "type": "Strength",
     "type_image": "img/hero_strength.png",
     "type_attack": "img/melee.svg",
     "complexity": 1,
     "complexity_image":"img/difficulty_1.png",
     "image": "img/bristleback.png",
     "image_big": "img/bristleback_big.png",
     "lore": {
       "full": "Ріґварл ніколи не уникав бійок і не повертався спиною до супротивника, навіть якщо той був більший і сильніший. Загартований у п'яних дебошах, він став постійним учасником підпільних боїв, що проводилися в тавернах на тракті між Сломом і Ельзе. Якось умілого бійця запримітив один шинкар, який шукав викидайла в бар. За скромну випивку Бронеспин став збирати з відвідувачів плату, стежити за порядком і час від часу ламати кінцівки особливо незговірливим клієнтам (а одному бідоласі членистоногому одного разу зламав цілих п'ять).\n\nТа все ж Бронеспину довелося зустріти бійця рівного собі. Одного разу під час чергової вечірньої вахти, вже напідпитку від хмелю, він підійшов за платою до одного кряжистого здорованя з півночі і, ледь вимовляючи слова, пробурмотів: «Щось не подобаються мені ваші бивні, шановний». Що тут почалося! Це було побоїще віку! У бій кинулося з дюжину відвідувачів. Не вцілів жоден стілець. Хоча Ріґварл неабияк приклався до галабурдників, але й сам не слабко отримав по печінці. І все б нічого, але сталося щось страшне — клієнт пішов, не заплативши за випивку. За кілька тижнів рани Бронеспина затягнулися, а вирвані голки відросли, однак удар по честі викидайла було завдано незрівнянний. Рахунок він оплатив зі своєї кишені і поклявся вистежити північанина та стягнути плату сповна. Після цього він зайнявся тренуваннями, чого раніше ніколи не робив, і несподівано для себе зробив вражаюче відкриття. Розправивши голки і усміхнувшись крізь зуби, він зрозумів — іноді все ж варто показувати супротивнику спину.",
       "short": "У бою Бронеспин не гребує повернутися до ворога спиною, адже завдяки панциру зі спини та боків він отримує значно менше шкоди. Зазвичай він знаходиться в гущі подій, де поливає ворогів голками та сповільнює їх своїми шмарклями."
     },
     "abilities": [
       {
         "name": "Viscous Nasal Goo",
         "description": "Вкриває ціль шаром шмарклів, які послаблюють броню та зменшують швидкість руху впродовж 6 с. З кожним плювком збільшується кількість шарів і поновлюється тривалість дії.",
         "image_ability": "img/bristleback_viscous_nasal_goo.png",
         "video": "img/Anime Dance Mix - Hypnodancer.mp4"
        },
       {
        "name": "Quill Spray",
        "description": "Випускає хмару голок, чим завдає шкоди всім ворожим істотам довкола. Якщо голки потрапляють в істоту з інтервалом менше 14, то їй завдається додаткова шкода.",
        "image_ability": "img/bristleback_quill_spray.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Bristleback",
        "description": "Бронеспин отримує менше шкоди, якщо його атакують із боків чи спини. Коли він отримує 275 шкоди в спину, то випускає Хмару голок поточного рівня.",
        "image_ability": "img/bristleback_bristleback.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Warpath",
        "description": "Бронеспина охоплює приступ люті кожного разу, як він використовує свої здібності, що збільшує швидкість його руху та посилює шкоду.",
        "image_ability": "img/bristleback_warpath.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      }
     ],
     "talent_tree_image": "img/talents.svg",
     "talent_tree_image_2": "img/bristl_tree.png",
     "passive": {
       "name": "Prickly",
       "description": "Бронеспин має 10% шкоди та збільшення тривалості негативних ефектів проти ворожих героїв, які перебувають позаду нього.",
       "image_passive": "img/innate_icon.png"
      },
    "facets": [
      {
      "name": "Snot Rocket",
      "image": "img/bristl_1.png"
    },
    {
      "name": "Seeing Red",
      "image": "img/bristl_2.png" 
    }
    ]
   },
   {
     "name": "Morphling",
     "type": "Agility",
     "type_image": "img/hero_agility.png",
     "type_attack": "img/ranged.svg",
     "complexity": 3,
     "complexity_image":"img/difficulty_3.png",
     "image": "img/morphling.png",
     "image_big": "img/morphling_big.png",
     "lore": {
        "full": "Багато століть комета борознила темну пустку космосу. Непохитні сили гравітації тримали її, ніби на повідку, подалі від сонця, що дозволило не розтанути масивній брилі льоду, яка здійснювала свою таємничу темну мандрівку. Та напередодні війни за Влой вона впала із зоряного неба і залишила палаючий слід вночі, який був сприйнятий обома арміями за знак долі. Заморожена куля почала танути під киплячим жаром атмосфери в той час, коли дві сторони зійшлися в сутичці на берегах вузької річки. І тоді, вирвавшись зі свого крижаного полону, був народжений Морфлінг, стихійна сила якого була необмежена і неприборкана, як океан. Він вступив у бій, інстинктивно прийнявши форму першого ж генерала, що наважився ступити до води, зануривши того в пучину. Поки дурні воїни кидалися у воду, Морфлінг переміщувався полем бою та змінював одну форму на іншу. Він миттєво приймав подобу цих дивних істот — то він виглядав як лучник, то як мечник, то як кавалерист. До загибелі останнього солдату Морфлінг встиг зіграти усі ролі. Та кінець битви став його початком.",
       "short": "Підлаштовуючи свої характеристики до ситуації, Морфлінг може бути як невловним, так і смертельно небезпечним. Мало хто сподівається загнати його в кут, коли він проходить хвилею флангами ворогів чи збільшує своє здоров'я, перш ніж перетвориться на оманливу копію."
     },
     "abilities": [
       {
         "name": "Waveform",
         "description": "Морфлінг розчиняється і мчить уперед, завдаючи шкоди ворогам на своєму шляху. Морфлінг невразливий під час дії здібності.",
         "image_ability": "img/morphling_waveform.png",
         "video": "img/Anime Dance Mix - Hypnodancer.mp4"
        },
       {
        "name": "Adaptive Strike",
        "description": "Запускає у ворожу істоту водяний стовп, завдаючи базової шкоди, а також додаткової шкоди, що залежить від спритності Морфлінга. Якщо спритність Морфлінга на 50% вища за його силу, використовується максимальний модифікатор спритності.\n\nЦіль також відштовхується назад відповідно до сили Морфлінга. Якщо його сила на 50% вища за спритність, то відштовхується на максимальну дальність.",
        "image_ability": "img/morphling_adaptive_strike_agi.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Attribute Shift (Agility)",
        "description": "Морфлінг змінює форму, перетворюючи свою силу на спритність. Процес зворотний. Підвищення рівня здібності підвищує швидкість зміни показників.",
        "image_ability": "img/morphling_morph_agi.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Attribute Shift (Strength)",
        "description": "Морфлінг змінює форму, перетворюючи свою спритність на силу. Процес зворотний. Підвищення рівня здібності підвищує швидкість зміни показників.",
        "image_ability": "img/morphling_morph_str.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      },
       {
        "name": "Morph",
        "description": "Морфлінг змінює свою форму на обраного ворожого героя, отримуючи його базові характеристики. Можна перемикати форму до завершення дії здібності.",
        "image_ability": "img/morphling_replicate.png",
        "video": "img/Anime Dance Mix - Hypnodancer.mp4"
      }
     ],
     "talent_tree_image": "img/talents.svg",
     "talent_tree_image_2": "img/morph_tree.png",
     "passive": {
       "name": "Accumulation",
       "description": "Морфлінг здобуває 50% від бонусів приросту характеристик за кожну половину рівня замість повних бонусів за один рівень. Усі додаткові характеристики за очки здібностей на дереві талантів дають додаткові +3 до основної характеристики Морфлінга.",
       "image_passive": "img/innate_icon.png"
      },
    "facets": [
      {
      "name": "Ebb",
      "image": "img/morph_1.png"
    },
    {
      "name": "Flow",
      "image": "img/morph_2.png" 
    }
    ]
   }
 ]
}